Assignement/Lab04-compressibleFlows/combustor2D-RPF-highRe-highT/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

dpdt	yes;

mixture
{
    specie
    {
        molWeight   	28.9;
    }
    thermodynamics
    {
	Cp		1004;
        Cv          	712;
        Hf          	0;
    }
    transport
    {
        mu          	1.8e-05;
        Pr          	0.7;
    }
}


// ************************************************************************* //
